In [1]:
#Groupby

In [2]:
import pandas as pd

In [6]:
var = pd.DataFrame({"Name":['a','b','c','d','a','b','a','b','a','c','c','d'],
                    "S1":[1,2,3,4,5,6,7,8,9,10,11,21],
                    "s2":[11,22,33,44,55,66,77,88,99,12,13,14]})
var

   Name  S1  s2
0     a   1  11
1     b   2  22
2     c   3  33
3     d   4  44
4     a   5  55
5     b   6  66
6     a   7  77
7     b   8  88
8     a   9  99
9     c  10  12
10    c  11  13
11    d  21  14

In [7]:
var_New = var.groupby("Name")
var_New

In [10]:
for x,y in var_New:
    print(x)
    print(y)
    print( )

a
  Name  S1  s2
0    a   1  11
4    a   5  55
6    a   7  77
8    a   9  99

b
  Name  S1  s2
1    b   2  22
5    b   6  66
7    b   8  88

c
   Name  S1  s2
2     c   3  33
9     c  10  12
10    c  11  13

d
   Name  S1  s2
3     d   4  44
11    d  21  14

In [11]:
var_New.get_group("a")#only a data show

  Name  S1  s2
0    a   1  11
4    a   5  55
6    a   7  77
8    a   9  99

In [12]:
var_New.min()

      S1  s2
Name
a      1  11
b      2  22
c      3  12
d      4  14

In [13]:
var_New.max()

      S1  s2
Name
a      9  99
b      8  88
c     11  33
d     21  44

In [14]:
var_New.mean()

             S1         s2
Name
a      5.500000  60.500000
b      5.333333  58.666667
c      8.000000  19.333333
d     12.500000  29.000000

In [15]:
li=list(var_New)
li

[('a',
    Name  S1  s2
  0    a   1  11
  4    a   5  55
  6    a   7  77
  8    a   9  99),
 ('b',
    Name  S1  s2
  1    b   2  22
  5    b   6  66
  7    b   8  88),
 ('c',
     Name  S1  s2
  2     c   3  33
  9     c  10  12
  10    c  11  13),
 ('d',
     Name  S1  s2
  3     d   4  44
  11    d  21  14)]

In [16]:
#join

In [21]:
var1 = pd.DataFrame({"A":[1,2,3,4],"B":[11,22,33,44]})
var2 = pd.DataFrame({"C":[1,2,3,4],"D":[10,20,30,40]})
var1.join(var2)

   A   B  C   D
0  1  11  1  10
1  2  22  2  20
2  3  33  3  30
3  4  44  4  40

In [26]:
var1 = pd.DataFrame({"A":[1,2,3,4],"B":[11,22,33,44]},index=['a','b','c','d'])
var2 = pd.DataFrame({"C":[1,2],"D":[10,20],index=['a','b']})
var1.join(var2)

SyntaxError: ':' expected after dictionary key (525942301.py, line 2)

In [27]:
#Append